const questions = [
  {
    id: 1,
    title: "Що таке JavaScript?",
    info: "JavaScript — це мова програмування, яка використовується для створення інтерактивних вебсторінок.",
  },
  {
    id: 2,
    title: "Для чого використовується React?",
    info: "React допомагає створювати динамічні інтерфейси користувача завдяки компонентам та системі станів.",
  },
  {
    id: 3,
    title: "Що таке хук useEffect?",
    info: "useEffect дозволяє виконувати побічні ефекти у функціональних компонентах, наприклад запити до API чи роботу з DOM.",
  },
  {
    id: 4,
    title: "Що таке Git?",
    info: "Git — це система контролю версій, яка допомагає відслідковувати зміни в коді та працювати в команді.",
  },
  {
    id: 5,
    title: "Що таке npm?",
    info: "npm — це менеджер пакетів для JavaScript, за допомогою якого можна встановлювати бібліотеки та інструменти.",
  },
];

export default questions;
